<a href="https://colab.research.google.com/github/bobby360/ML_Stage4/blob/master/Stage4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Setting up kaggle.

In [11]:
#Setting up Kaggle
!pip install kaggle
!mkdir .kaggle
import json
token = {"username":"bobbyml","key":"ac9a2a8daab26dce1c864312a6705acf"}
with open('/content/.kaggle/kaggle.json', 'w') as file:
    json.dump(token, file)

Requirement already satisfied: kaggle in /usr/local/lib/python3.6/dist-packages (1.5.6)
Requirement already satisfied: python-dateutil in /usr/local/lib/python3.6/dist-packages (from kaggle) (2.5.3)
Requirement already satisfied: tqdm in /usr/local/lib/python3.6/dist-packages (from kaggle) (4.28.1)
Requirement already satisfied: python-slugify in /usr/local/lib/python3.6/dist-packages (from kaggle) (3.0.4)
Requirement already satisfied: certifi in /usr/local/lib/python3.6/dist-packages (from kaggle) (2019.9.11)
Requirement already satisfied: six>=1.10 in /usr/local/lib/python3.6/dist-packages (from kaggle) (1.12.0)
Requirement already satisfied: urllib3<1.25,>=1.21.1 in /usr/local/lib/python3.6/dist-packages (from kaggle) (1.24.3)
Requirement already satisfied: requests in /usr/local/lib/python3.6/dist-packages (from kaggle) (2.21.0)
Requirement already satisfied: text-unidecode>=1.3 in /usr/local/lib/python3.6/dist-packages (from python-slugify->kaggle) (1.3)
Requirement already satisfied: chardet<3.1.0,>=3.0.2 in /usr/local/lib/python3.6/dist-packages (from requests->kaggle) (3.0.4)
Requirement already satisfied: idna<2.9,>=2.5 in /usr/local/lib/python3.6/dist-packages (from requests->kaggle) (2.8)
mkdir: cannot create directory ‘.kaggle’: File exists

In [0]:
!cp /content/.kaggle/kaggle.json ~/.kaggle/kaggle.json

In [9]:
!kaggle config set -n path -v{/content}

Warning: Your Kaggle API key is readable by other users on this system! To fix this, you can run 'chmod 600 /root/.kaggle/kaggle.json'
- path is now set to: {/content}

In [10]:
#Downloading the dataset
!kaggle datasets download -d snap/amazon-fine-food-reviews -p /content

Warning: Your Kaggle API key is readable by other users on this system! To fix this, you can run 'chmod 600 /root/.kaggle/kaggle.json'
Downloading amazon-fine-food-reviews.zip to /content
 96% 233M/242M [00:04<00:00, 66.5MB/s]
100% 242M/242M [00:04<00:00, 52.0MB/s]

In [12]:
#Unzipping
!unzip \*.zip

Archive:  amazon-fine-food-reviews.zip
  inflating: Reviews.csv
  inflating: database.sqlite
  inflating: hashes.txt

In [0]:
import pandas as pd
import numpy
import sqlite3

### **TASK 1 and 2: filtering only positive and negative reviews i.e. not taking into consideration those reviews with Score=3; Produce a schema of user id, product id, profile name, time, score, text and count where count is greater than one.**

In [15]:
# Positive review Score > 3, Negative review Score < 3
conn = sqlite3.connect("database.sqlite")

df = pd.read_sql_query("""select UserId, ProductId, 
                          ProfileName, Time,
                          Score, Text, COUNT(*)
                          FROM reviews
                          WHERE Score != 3
                          GROUP BY UserId
                          HAVING COUNT(*) > 1""", conn)
a = df.head()
df.head()

               UserId  ... COUNT(*)
0  #oc-R115TNMSPFT9I7  ...        2
1  #oc-R11D9D7SHXIJB9  ...        3
2  #oc-R11DNU2NBKQ23Z  ...        2
3  #oc-R11O5J5ZVQE25C  ...        3
4  #oc-R12KPBODL2B5ZD  ...        2

[5 rows x 7 columns]

### **TASK 3: Sort product id in ascending order and deduplicate data.**

In [16]:
df.sort_values('ProductId', inplace= True)
df.drop_duplicates(subset ="ProductId", 
                     keep = False, inplace = True)
df.head()

               UserId  ... COUNT(*)
53360  A3OI7ZGH6WZJ5G  ...        2
26134  A2BEAAU6N7K8GD  ...        2
19211  A1YVJENMZL29O7  ...        3
473     A10K7E9F0THV3  ...        4
41746  A33BL538BKBA0S  ...        2

[5 rows x 7 columns]

### **TASK 4: How many positive and negative reviews are present in our dataset**

In [25]:
# Positive review scores: 4,5; Negative review scores 1,2
pos_rev = df['Score'].value_counts()[4] + df['Score'].value_counts()[5]
neg_rev = df['Score'].value_counts()[1] + df['Score'].value_counts()[2]

print("There are " + str(pos_rev), 'positive reviews in the dataset')
print("There are " + str(neg_rev), 'negative reviews in the dataset')

There are 9949 positive reviews in the dataset
There are 1844 negative reviews in the dataset

### **TASK 5: Remove the html tags**

In [23]:
from html.parser import HTMLParser

class MLStripper(HTMLParser):
    def __init__(self):
        self.reset()
        self.strict = False
        self.convert_charrefs= True
        self.fed = []
    def handle_data(self, d):
        self.fed.append(d)
    def get_data(self):
        return ''.join(self.fed)

def strip_tags(html):
    s = MLStripper()
    s.feed(html)
    return s.get_data()
  
df['Text'] = df['Text'].apply(strip_tags)

df.head()

               UserId  ... COUNT(*)
53360  A3OI7ZGH6WZJ5G  ...        2
26134  A2BEAAU6N7K8GD  ...        2
19211  A1YVJENMZL29O7  ...        3
473     A10K7E9F0THV3  ...        4
41746  A33BL538BKBA0S  ...        2

[5 rows x 7 columns]

### **TASK 6: Remove any punctuations or limited set of special characters**

In [26]:
import re

def no_symbols(text):
  return re.sub("[^A-z0-9\s]+", "", text)
  
df['Text'] = df['Text'].apply(no_symbols)

df.head()

               UserId  ... COUNT(*)
53360  A3OI7ZGH6WZJ5G  ...        2
26134  A2BEAAU6N7K8GD  ...        2
19211  A1YVJENMZL29O7  ...        3
473     A10K7E9F0THV3  ...        4
41746  A33BL538BKBA0S  ...        2

[5 rows x 7 columns]

### **TASK 7: Check if the word is made up of English letters and is not alpha-numeric**

In [27]:
def letters_only(text):
	return re.sub("[^a-zA-Z\s]", "", text)

df['Text'] = df['Text'].apply(letters_only)

df.head()

               UserId  ... COUNT(*)
53360  A3OI7ZGH6WZJ5G  ...        2
26134  A2BEAAU6N7K8GD  ...        2
19211  A1YVJENMZL29O7  ...        3
473     A10K7E9F0THV3  ...        4
41746  A33BL538BKBA0S  ...        2

[5 rows x 7 columns]

### **TASK 8: Check to see if the length of the word is greater than 2**

In [28]:
def check_length(text):
  text = text.split()
  contain = []
  
  for word in text:
    if len(word) > 2:
      contain.append(word)
      
  final = ' '.join(contain)
  return final
      
  
df['Text'] = df['Text'].apply(check_length)

df.head()

               UserId  ... COUNT(*)
53360  A3OI7ZGH6WZJ5G  ...        2
26134  A2BEAAU6N7K8GD  ...        2
19211  A1YVJENMZL29O7  ...        3
473     A10K7E9F0THV3  ...        4
41746  A33BL538BKBA0S  ...        2

[5 rows x 7 columns]

### **TASK 9: Convert the word to lowercase**

In [29]:
def lower_case(text):
  return text.lower()

df['Text'] = df['Text'].apply(lower_case)

df.head()

               UserId  ... COUNT(*)
53360  A3OI7ZGH6WZJ5G  ...        2
26134  A2BEAAU6N7K8GD  ...        2
19211  A1YVJENMZL29O7  ...        3
473     A10K7E9F0THV3  ...        4
41746  A33BL538BKBA0S  ...        2

[5 rows x 7 columns]

### **TASK 10: Remove Stopwords**

In [31]:
import nltk

def remove_stopwords(text):
  try:
    from nltk.corpus import stopwords
    from nltk.tokenize import word_tokenize
    stop_words = set(stopwords.words('english'))
    word_tokens = word_tokenize(text)
    filtered_sentence = [w for w in word_tokens if not w in stop_words]
    
  except:
    nltk.download("stopwords")
    nltk.download("punkt")
    return remove_stopwords(text)
  
  return " ".join(filtered_sentence)

df['Text'] = df['Text'].apply(remove_stopwords)

df.head()

               UserId  ... COUNT(*)
53360  A3OI7ZGH6WZJ5G  ...        2
26134  A2BEAAU6N7K8GD  ...        2
19211  A1YVJENMZL29O7  ...        3
473     A10K7E9F0THV3  ...        4
41746  A33BL538BKBA0S  ...        2

[5 rows x 7 columns]

### **TASK 11: Finally Snowball Stemming the word**

In [32]:
import nltk
from nltk.corpus import stopwords
from nltk.stem import SnowballStemmer

def stem_thy_words(text):
    snowball_stemmer = SnowballStemmer('english')
    word_tokens = nltk.word_tokenize(text)
    stemmed_word = [snowball_stemmer.stem(word) for word in word_tokens]
    return " ".join(stemmed_word)

df['Text'] = df['Text'].apply(stem_thy_words)
df.head()

               UserId  ... COUNT(*)
53360  A3OI7ZGH6WZJ5G  ...        2
26134  A2BEAAU6N7K8GD  ...        2
19211  A1YVJENMZL29O7  ...        3
473     A10K7E9F0THV3  ...        4
41746  A33BL538BKBA0S  ...        2

[5 rows x 7 columns]